In [27]:
#person_df
# Establish connection to the source SQL Server database and read data

import warnings
import pandas as pd
import pyodbc
warnings.simplefilter('ignore')

# Connection details for the source SQL Server database
source_db = {
    'servername': r'DESKTOP-R9U7MMK\SQLEXPRESS',
    'database': 'AdventureWorks2019'
}

# Connection details for the destination SQL Server database
destination_db = {
    'servername': r'DESKTOP-R9U7MMK\SQLEXPRESS',
    'database': 'PR4'
}

# Connection string for the source SQL Server database
source_conn_str = (
    'Driver={SQL Server};'
    'SERVER=' + source_db['servername'] + ';'
    'DATABASE=' + source_db['database'] + ';'
    'Trusted_Connection=yes;'
)

# Connection string for the destination SQL Server database
destination_conn_str = (
    'Driver={SQL Server};'
    'SERVER=' + destination_db['servername'] + ';'
    'DATABASE=' + destination_db['database'] + ';'
    'Trusted_Connection=yes;'
)
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        person_df = pd.read_sql_query("SELECT * FROM Person.person", source_conn)
        personPhone_df = pd.read_sql_query("SELECT PhoneNumber, PhoneNumberTypeID, BusinessEntityID FROM Person.PersonPhone", source_conn)
        personEmailAdress_df = pd.read_sql_query("SELECT EmailAddressID, EmailAddress, BusinessEntityID FROM Person.EmailAddress", source_conn)
        personPassword_df = pd.read_sql_query("SELECT PasswordHash, PasswordSalt, BusinessEntityID FROM Person.Password", source_conn)

        # Merging DataFrames
        merged_df = pd.merge(person_df, personPhone_df, on='BusinessEntityID', how='left')
        merged_df = pd.merge(merged_df, personEmailAdress_df, on='BusinessEntityID', how='left')
        merged_df = pd.merge(merged_df, personPassword_df, on='BusinessEntityID', how='left')

except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)

# Establish connection to the destination SQL Server database and insert data
# try:
#     with pyodbc.connect(destination_conn_str) as destination_conn:
#         cursor = destination_conn.cursor()
#         
#         # Batch insert
#         insert_query = """
#         INSERT INTO [PR4].[dbo].[INVENTORY_SALES_LEVELS]
#         (INVENTORY_YEAR, INVENTORY_MONTH, PRODUCT_NUMBER, INVENTORY_COUNT, MARGIN, LANGUAGE, DESCRIPTION)
#         VALUES (?, ?, ?, ?, ?, ?, ?)
#         """
#         
#         # Convert DataFrame to a list of tuples for batch insertion
#         data_to_insert = merged_df[['INVENTORY_YEAR', 'INVENTORY_MONTH', 'PRODUCT_NUMBER', 'INVENTORY_COUNT', 'MARGIN', 'LANGUAGE', 'DESCRIPTION']].values.tolist()
#         
#         # Executing batch insert
#         cursor.executemany(insert_query, data_to_insert)
#         
#         # Commit transaction
#         destination_conn.commit()
#         
#         print("Data inserted svsvvsuccessfully.")
# except pyodbc.Error as e:
#     print("Error while connecting to the destination SQL Server or inserting data:", e)
merged_df

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate,PhoneNumber,PhoneNumberTypeID,EmailAddressID,EmailAddress,PasswordHash,PasswordSalt
0,1,EM,False,None,Ken,J,Sánchez,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",92C4279F-1207-48A3-8448-4636514EB7E2,2009-01-07,697-555-0142,1,1,ken0@adventure-works.com,pbFwXWE99vobT6g+vPWFy93NtUU/orrIWafF01hccfM=,bE3XiWw=
1,2,EM,False,None,Terri,Lee,Duffy,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D8763459-8AA8-47CC-AFF7-C9079AF79033,2008-01-24,819-555-0175,3,2,terri0@adventure-works.com,bawRVNrZQYQ05qF05Gz6VLilnviZmrqBReTTAGAudm0=,EjJaC3U=
2,3,EM,False,None,Roberto,None,Tamburello,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",E1A2555E-0828-434B-A33B-6F38136A37DE,2007-11-04,212-555-0187,1,3,roberto0@adventure-works.com,8BUXrZfDqO1IyHCWOYzYmqN1IhTUn3CJMpdx/UCQ3iY=,wbPZqMw=
3,4,EM,False,None,Rob,None,Walters,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F2D7CE06-38B3-4357-805B-F4B6B71C01FF,2007-11-28,612-555-0100,1,4,rob0@adventure-works.com,SjLXpiarHSlz+6AG+H+4QpB/IPRzras/+9q/5Wr7tf8=,PwSunQU=
4,5,EM,False,Ms.,Gail,A,Erickson,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",F3A3F6B4-AE3B-430C-A754-9F2231BA6FEF,2007-12-30,849-555-0139,1,5,gail0@adventure-works.com,8FYdAiY6gWuBsgjCFdg0UibtsqOcWHf9TyaHIP7+paA=,qYhZRiM=
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19967,20773,IN,False,None,Crystal,None,Guo,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",D0A499A2-C258-43E9-AB06-F61543A71134,2014-03-19,1 (11) 500 555-0171,1,19968,crystal18@adventure-works.com,4gSNTcSKHtKW1k9te824egho2RixU5Gc+LRDNYyMDx4=,qh4YKRQ=
19968,20774,IN,False,None,Isabella,F,Richardson,None,2,None,"<IndividualSurvey xmlns=""http://schemas.micros...",A4F7F248-82F3-43D5-B5A3-8BD1CB610254,2013-07-29,910-555-0166,1,19969,isabella91@adventure-works.com,gOO6OEoRpCe9TiQ4+1fX1qXIzavOQ0Ccvl1JHS/Pseg=,s+EMJTA=
19969,20775,IN,False,None,Crystal,S,He,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",CD0B82D0-3409-4497-A65F-A68E75EE26CB,2014-03-12,813-555-0148,2,19970,crystal19@adventure-works.com,r5nZct0C8mWL6KM0DE4pM8fO/0nmUYAtya8ref2efg8=,axcde7k=
19970,20776,IN,False,None,Crystal,None,Zheng,None,1,None,"<IndividualSurvey xmlns=""http://schemas.micros...",386E35E8-97B3-43E4-9B5F-9594C2FF5CEA,2014-01-14,1 (11) 500 555-0171,2,19971,crystal20@adventure-works.com,5eVmZbWYJXVwZkBkvpxlhA3/bKMLRReav9CgRP4NRbU=,nJbmm88=
19971,20777,IN,False,None,Crystal,None,Hu,None,0,None,"<IndividualSurvey xmlns=""http://schemas.micros...",1773C8F3-2CC7-4826-A7F5-30D3F36543CD,2013-10-16,1 (11) 500 555-0126,2,19972,crystal21@adventure-works.com,ZEgQH9qZIPiLgyBHYw/dD1FJQNpdQyIAa+BFfKX5/jg=,7iy/umc=

In [16]:
#businessEntity_df
# Establish connection to the source SQL Server database and read datangffgngfvng
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        businessEntity_df = pd.read_sql_query("SELECT BusinessEntityID FROM Person.BusinessEntity", source_conn)

except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)

# Establish connection to the destination SQL Server database and insert data
# try:
#     with pyodbc.connect(destination_conn_str) as destination_conn:
#         cursor = destination_conn.cursor()
#         
#         # Batch insert
#         insert_query = """
#         INSERT INTO [PR4].[dbo].[INVENTORY_SALES_LEVELS]
#         (INVENTORY_YEAR, INVENTORY_MONTH, PRODUCT_NUMBER, INVENTORY_COUNT, MARGIN, LANGUAGE, DESCRIPTION)
#         VALUES (?, ?, ?, ?, ?, ?, ?)
#         """
#         
#         # Convert DataFrame to a list of tuples for batch insertion
#         data_to_insert = merged_df[['INVENTORY_YEAR', 'INVENTORY_MONTH', 'PRODUCT_NUMBER', 'INVENTORY_COUNT', 'MARGIN', 'LANGUAGE', 'DESCRIPTION']].values.tolist()
#         
#         # Executing batch insert
#         cursor.executemany(insert_query, data_to_insert)
#         
#         # Commit transaction
#         destination_conn.commit()
#         
#         print("Data inserted successfully.")
# except pyodbc.Error as e:
#     print("Error while connecting to the destination SQL Server or inserting data:", e)
businessEntity_df

       BusinessEntityID
0                  4577
1                 14491
2                 14881
3                 11383
4                  9663
...                 ...
20772              3788
20773             12987
20774             12759
20775                58
20776             20729

[20777 rows x 1 columns]

In [23]:
#businessEntityAddress_df
# Establish connection to the source SQL Server database and read data
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        businessEntityAddress_df = pd.read_sql_query("SELECT AddressID, AddressTypeID, BusinessEntityID FROM Person.BusinessEntityAddress", source_conn)
        addressType_df = pd.read_sql_query("SELECT AddressTypeID, Name FROM Person.AddressType", source_conn)
                                           
        # Merging DataFrames
        businessEntityAddress_df = pd.merge(businessEntityAddress_df, addressType_df, on='AddressTypeID', how='left')
except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)

# Establish connection to the destination SQL Server database and insert data
# try:
#     with pyodbc.connect(destination_conn_str) as destination_conn:
#         cursor = destination_conn.cursor()
#         
#         # Batch insert
#         insert_query = """
#         INSERT INTO [PR4].[dbo].[INVENTORY_SALES_LEVELS]
#         (INVENTORY_YEAR, INVENTORY_MONTH, PRODUCT_NUMBER, INVENTORY_COUNT, MARGIN, LANGUAGE, DESCRIPTION)
#         VALUES (?, ?, ?, ?, ?, ?, ?)
#         """
#         
#         # Convert DataFrame to a list of tuples for batch insertion
#         data_to_insert = merged_df[['INVENTORY_YEAR', 'INVENTORY_MONTH', 'PRODUCT_NUMBER', 'INVENTORY_COUNT', 'MARGIN', 'LANGUAGE', 'DESCRIPTION']].values.tolist()
#         
#         # Executing batch insert
#         cursor.executemany(insert_query, data_to_insert)
#         
#         # Commit transaction
#         destination_conn.commit()
#         
#         print("Data inserted successfully.")
# except pyodbc.Error as e:
#     print("Error while connecting to the destination SQL Server or inserting data:", e)
businessEntityAddress_df

       AddressID  AddressTypeID  BusinessEntityID      Name
0            249              2                 1      Home
1            293              2                 2      Home
2            224              2                 3      Home
3          11387              2                 4      Home
4            190              2                 5      Home
...          ...            ...               ...       ...
19609        206              5             20099  Shipping
19610        217              5             20305  Shipping
19611        222              5             20419  Shipping
19612        255              5             20550  Shipping
19613        290              5             20759  Shipping

[19614 rows x 4 columns]

In [24]:
#person.Address_df
# Establish connection to the source SQL Server database and read data
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        personAddress_df = pd.read_sql_query("SELECT AddressID, AddressLine1, AddressLine2, City, StateProvinceID, PostalCode, SpatialLocation FROM Person.Address", source_conn)
                                           
except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)

# Establish connection to the destination SQL Server database and insert data
# try:
#     with pyodbc.connect(destination_conn_str) as destination_conn:
#         cursor = destination_conn.cursor()
#         
#         # Batch insert
#         insert_query = """
#         INSERT INTO [PR4].[dbo].[INVENTORY_SALES_LEVELS]
#         (INVENTORY_YEAR, INVENTORY_MONTH, PRODUCT_NUMBER, INVENTORY_COUNT, MARGIN, LANGUAGE, DESCRIPTION)
#         VALUES (?, ?, ?, ?, ?, ?, ?)
#         """
#         
#         # Convert DataFrame to a list of tuples for batch insertion
#         data_to_insert = merged_df[['INVENTORY_YEAR', 'INVENTORY_MONTH', 'PRODUCT_NUMBER', 'INVENTORY_COUNT', 'MARGIN', 'LANGUAGE', 'DESCRIPTION']].values.tolist()
#         
#         # Executing batch insert
#         cursor.executemany(insert_query, data_to_insert)
#         
#         # Commit transaction
#         destination_conn.commit()
#         
#         print("Data inserted successfully.")
# except pyodbc.Error as e:
#     print("Error while connecting to the destination SQL Server or inserting data:", e)
personAddress_df

,AddressID,AddressLine1,AddressLine2,City,StateProvinceID,PostalCode,SpatialLocation
0,1,1970 Napa Ct.,None,Bothell,79,98011,b'\xe6\x10\x00\x00\x01\x0c\xae\x8b\xfc(\xbc\xe...
1,2,9833 Mt. Dias Blv.,None,Bothell,79,98011,b'\xe6\x10\x00\x00\x01\x0c\xd6\xfa\x85\x1a\xe6...
2,3,7484 Roundtree Drive,None,Bothell,79,98011,b'\xe6\x10\x00\x00\x01\x0c\x18\xe3\x04\xc4\xad...
3,4,9539 Glenside Dr,None,Bothell,79,98011,b'\xe6\x10\x00\x00\x01\x0c\x81:\r_\x9f\xdeG@\x...
4,5,1226 Shoe St.,None,Bothell,79,98011,b'\xe6\x10\x00\x00\x01\x0ca\xc6M\x8a\xbb\xd9G@...
...,...,...,...,...,...,...,...
19609,32517,177 11th Ave,None,Sammamish,79,98074,b'\xe6\x10\x00\x00\x01\x0c\xbf\xdc\xce8m\xd6G@...
19610,32518,8040 Hill Ct,None,Redmond,79,98052,b'\xe6\x10\x00\x00\x01\x0cnU\xa1\x19H\xd4G@r1\...
19611,32519,137 Mazatlan,None,Seattle,79,98104,b'\xe6\x10\x00\x00\x01\x0c\x12/\x1f\xe5\x87\xc...
19612,32520,5863 Sierra,None,Bellevue,79,98004,b'\xe6\x10\x00\x00\x01\x0c\xf7W\x1d{\xf0\xccG@...
19613,32521,7145 Matchstick Drive,None,Sammamish,79,98074,b'\xe6\x10\x00\x00\x01\x0c\xeeD\xc4\x96;\xcaG@...

In [33]:
#Sales.CreditCard
# Establish connection to the source SQL Server database and read data
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        creditCard_df = pd.read_sql_query("SELECT CreditCardID, CardType, CardNumber, ExpMonth, ExpYear FROM Sales.CreditCard", source_conn)
        personCreditCard_df = pd.read_sql_query("SELECT CreditCardID, BusinessEntityID FROM Sales.PersonCreditCard", source_conn)
        
        # Merging DataFrames
        creditCard_df = pd.merge(creditCard_df, personCreditCard_df, on='CreditCardID', how='left')
except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)

# Establish connection to the destination SQL Server database and insert data
# try:
#     with pyodbc.connect(destination_conn_str) as destination_conn:
#         cursor = destination_conn.cursor()
#         
#         # Batch insert
#         insert_query = """
#         INSERT INTO [PR4].[dbo].[INVENTORY_SALES_LEVELS]
#         (INVENTORY_YEAR, INVENTORY_MONTH, PRODUCT_NUMBER, INVENTORY_COUNT, MARGIN, LANGUAGE, DESCRIPTION)
#         VALUES (?, ?, ?, ?, ?, ?, ?)
#         """
#         
#         # Convert DataFrame to a list of tuples for batch insertion
#         data_to_insert = merged_df[['INVENTORY_YEAR', 'INVENTORY_MONTH', 'PRODUCT_NUMBER', 'INVENTORY_COUNT', 'MARGIN', 'LANGUAGE', 'DESCRIPTION']].values.tolist()
#         
#         # Executing batch insert
#         cursor.executemany(insert_query, data_to_insert)
#         
#         # Commit transaction
#         destination_conn.commit()
#         
#         print("Data inserted successfully.")
# except pyodbc.Error as e:
#     print("Error while connecting to the destination SQL Server or inserting data:", e)
creditCard_df

,CreditCardID,CardType,CardNumber,ExpMonth,ExpYear,BusinessEntityID
0,1,SuperiorCard,33332664695310,11,2006,4955
1,2,Distinguish,55552127249722,8,2005,13222
2,3,ColonialVoice,77778344838353,7,2005,7082
3,4,ColonialVoice,77774915718248,7,2006,9347
4,5,Vista,11114404600042,4,2005,11277
...,...,...,...,...,...,...
19113,19233,SuperiorCard,33335458414079,1,2005,5116
19114,19234,Vista,11114074915665,1,2007,2734
19115,19235,ColonialVoice,77774511327745,1,2006,6402
19116,19236,Vista,11112645284978,10,2008,12007
19117,19237,SuperiorCard,33336254511031,5,2005,14372

In [75]:
#Sales.SalesPerson
# Establish connection to the source SQL Server database and read data
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        salesPerson_df = pd.read_sql_query("SELECT BusinessEntityID, TerritoryID, SalesQuota, Bonus, CommissionPct, SalesLastYear, SalesYTD FROM Sales.SalesPerson", source_conn)

except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)

salesPerson_df

,BusinessEntityID,TerritoryID,SalesQuota,Bonus,CommissionPct,SalesLastYear,SalesYTD
0,274,NaN,NaN,0.0,0.000,0.000000e+00,5.596976e+05
1,275,2.0,300000.0,4100.0,0.012,1.750406e+06,3.763178e+06
2,276,4.0,250000.0,2000.0,0.015,1.439156e+06,4.251369e+06
3,277,3.0,250000.0,2500.0,0.015,1.997186e+06,3.189418e+06
4,278,6.0,250000.0,500.0,0.010,1.620277e+06,1.453719e+06
5,279,5.0,300000.0,6700.0,0.010,1.849641e+06,2.315186e+06
6,280,1.0,250000.0,5000.0,0.010,1.927059e+06,1.352577e+06
7,281,4.0,250000.0,3550.0,0.010,2.073506e+06,2.458536e+06
8,282,6.0,250000.0,5000.0,0.015,2.038235e+06,2.604541e+06
9,283,1.0,250000.0,3500.0,0.012,1.371635e+06,1.573013e+06
10,284,1.0,300000.0,3900.0,0.019,0.000000e+00,1.576562e+06
11,285,NaN,NaN,0.0,0.000,0.000000e+00,1.725245e+05
12,286,9.0,250000.0,5650.0,0.018,2.278549e+06,1.421811e+06
13,287,NaN,NaN,0.0,0.000,0.000000e+00,5.199059e+05
14,288,8.0,250000.0,75.0,0.018,1.307950e+06,1.827067e+06
15,289,10.0,250000.0,5150.0,0.020,1.635823e+06,4.116871e+06
16,290,7.0,250000.0,985.0,0.016,2.396540e+06,3.121616e+06

In [82]:
#Sales.Store
# Establish connection to the source SQL Server database and read data
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        salesStore_df = pd.read_sql_query("SELECT BusinessEntityID, Name, SalesPersonID FROM Sales.Store", source_conn)

except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)

salesStore_df

     BusinessEntityID                            Name  SalesPersonID
0                 292            Next-Door Bike Store            279
1                 294  Professional Sales and Service            276
2                 296                  Riders Company            277
3                 298              The Bike Mechanics            275
4                 300               Nationwide Supply            286
..                ...                             ...            ...
696              1988                     Retreat Inn            282
697              1990   Technical Parts Manufacturing            281
698              1992         Totes & Baskets Company            277
699              1994                  World of Bikes            277
700              2051           A Bicycle Association            275

[701 rows x 3 columns]

In [83]:
#Sales.SalesPersonQuotaHistory
# Establish connection to the source SQL Server database and read data
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        salesPersonQuotaHistory_df = pd.read_sql_query("SELECT BusinessEntityID, QuotaDate, SalesQuota FROM Sales.SalesPersonQuotaHistory", source_conn)

except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)

salesPersonQuotaHistory_df

     BusinessEntityID  QuotaDate  SalesQuota
0                 274 2011-05-31     28000.0
1                 274 2011-08-31      7000.0
2                 274 2011-12-01     91000.0
3                 274 2012-02-29    140000.0
4                 274 2012-05-30     70000.0
..                ...        ...         ...
158               290 2013-02-28    404000.0
159               290 2013-05-30   1262000.0
160               290 2013-08-30   1057000.0
161               290 2013-11-30    707000.0
162               290 2014-03-01    908000.0

[163 rows x 3 columns]

In [85]:
#Sales.SalesTerritoryHistory
# Establish connection to the source SQL Server database and read data
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        salesTerritoryHistory_df = pd.read_sql_query("SELECT BusinessEntityID, TerritoryID, StartDate, EndDate FROM Sales.salesTerritoryHistory", source_conn)

except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)

salesTerritoryHistory_df

    BusinessEntityID  TerritoryID  StartDate    EndDate
0                275            2 2011-05-31 2012-11-29
1                275            3 2012-11-30        NaT
2                276            4 2011-05-31        NaT
3                277            3 2011-05-31 2012-11-29
4                277            2 2012-11-30        NaT
5                278            6 2011-05-31        NaT
6                279            5 2011-05-31        NaT
7                280            1 2011-05-31 2012-09-29
8                281            4 2011-05-31        NaT
9                282            6 2011-05-31 2012-05-29
10               282           10 2012-05-30        NaT
11               283            1 2011-05-31        NaT
12               284            1 2012-09-30        NaT
13               286            9 2013-05-30        NaT
14               288            8 2013-05-30        NaT
15               289            6 2012-05-30        NaT
16               290            7 2012-05-30        NaT

In [94]:
#Sales.SalesTerritory
# Establish connection to the source SQL Server database and read data
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        SalesTerritory_df = pd.read_sql_query("SELECT TerritoryID, Name, CountryRegionCode, [Group], SalesYTD, SalesLastYear, CostYTD, CostLastYear FROM Sales.SalesTerritory", source_conn)

except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)

SalesTerritory_df

,TerritoryID,Name,CountryRegionCode,Group,SalesYTD,SalesLastYear,CostYTD,CostLastYear
0,1,Northwest,US,North America,7.887187e+06,3.298694e+06,0.0,0.0
1,2,Northeast,US,North America,2.402177e+06,3.607149e+06,0.0,0.0
2,3,Central,US,North America,3.072175e+06,3.205014e+06,0.0,0.0
3,4,Southwest,US,North America,1.051085e+07,5.366576e+06,0.0,0.0
4,5,Southeast,US,North America,2.538667e+06,3.925071e+06,0.0,0.0
5,6,Canada,CA,North America,6.771829e+06,5.693989e+06,0.0,0.0
6,7,France,FR,Europe,4.772398e+06,2.396540e+06,0.0,0.0
7,8,Germany,DE,Europe,3.805202e+06,1.307950e+06,0.0,0.0
8,9,Australia,AU,Pacific,5.977815e+06,2.278549e+06,0.0,0.0
9,10,United Kingdom,GB,Europe,5.012905e+06,1.635823e+06,0.0,0.0

In [108]:
#Sales.CountryRegionCurrency
# Establish connection to the source SQL Server database and read data
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        CountryRegionCurrency_df = pd.read_sql_query("SELECT CountryRegionCode, CurrencyCode FROM Sales.CountryRegionCurrency",source_conn)

except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)

CountryRegionCurrency_df

    CountryRegionCode CurrencyCode
0                  AE          AED
1                  AR          ARS
2                  AT          ATS
3                  AU          AUD
4                  BB          BBD
..                ...          ...
104                UY          UYU
105                VE          VEB
106                VN          VND
107                ZA          ZAR
108                ZW          ZWD

[109 rows x 2 columns]

In [109]:
#Sales.Currency
# Establish connection to the source SQL Server database and read data
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        currency_df = pd.read_sql_query("SELECT CurrencyCode, Name FROM Sales.Currency",source_conn)

except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)

currency_df

    CurrencyCode             Name
0            AFA          Afghani
1            DZD   Algerian Dinar
2            ARS   Argentine Peso
3            AMD    Armenian Dram
4            AWG   Aruban Guilder
..           ...              ...
100          KRW              Won
101          JPY              Yen
102          CNY    Yuan Renminbi
103          ZWD  Zimbabwe Dollar
104          PLN            Zloty

[105 rows x 2 columns]

In [80]:
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        sales_order_header_df = pd.read_sql_query("SELECT SalesOrderID, OrderDate, DueDate, ShipDate, Status, SalesOrderNumber, PurchaseOrderNumber, AccountNumber, CustomerID, SalesPersonID, TerritoryID, BillToAddressID, ShipToAddressID, ShipMethodID, CurrencyRateID, CreditCardID, SubTotal, TaxAmt, Freight, TotalDue   FROM Sales.SalesOrderHeader", source_conn)
        sales_order_detail_df = pd.read_sql_query("SELECT SalesOrderDetailID, CarrierTrackingNumber , OrderQty, ProductID,SpecialOfferID,UnitPrice, UnitPriceDiscount, LineTotal, SalesOrderID  FROM Sales.SalesOrderDetail ", source_conn)
        currency_rate_df = pd.read_sql_query("SELECT CurrencyRateID, CurrencyRateDate,FromCurrencyCode, ToCurrencyCode, AverageRate, EndOfDayRate  FROM Sales.CurrencyRate", source_conn)
        
        ## merging dataframes
        sales_order_df = pd.merge(sales_order_header_df, currency_rate_df, on='CurrencyRateID', how='left')
        sales_order_df = pd.merge(sales_order_detail_df, sales_order_df, on='SalesOrderID', how='left')
                           
except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)
sales_order_df

,SalesOrderDetailID,CarrierTrackingNumber,OrderQty,ProductID,SpecialOfferID,UnitPrice,UnitPriceDiscount,LineTotal,SalesOrderID,OrderDate,...,CreditCardID,SubTotal,TaxAmt,Freight,TotalDue,CurrencyRateDate,FromCurrencyCode,ToCurrencyCode,AverageRate,EndOfDayRate
0,1,4911-403C-98,1,776,1,2024.994,0.0,2024.994,43659,2011-05-31,...,16281.0,20565.6206,1971.5149,616.0984,23153.2339,NaT,NaN,NaN,NaN,NaN
1,2,4911-403C-98,3,777,1,2024.994,0.0,6074.982,43659,2011-05-31,...,16281.0,20565.6206,1971.5149,616.0984,23153.2339,NaT,NaN,NaN,NaN,NaN
2,3,4911-403C-98,1,778,1,2024.994,0.0,2024.994,43659,2011-05-31,...,16281.0,20565.6206,1971.5149,616.0984,23153.2339,NaT,NaN,NaN,NaN,NaN
3,4,4911-403C-98,1,771,1,2039.994,0.0,2039.994,43659,2011-05-31,...,16281.0,20565.6206,1971.5149,616.0984,23153.2339,NaT,NaN,NaN,NaN,NaN
4,5,4911-403C-98,1,772,1,2039.994,0.0,2039.994,43659,2011-05-31,...,16281.0,20565.6206,1971.5149,616.0984,23153.2339,NaT,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
121312,121313,None,1,878,1,21.980,0.0,21.980,75122,2014-06-30,...,18719.0,30.9700,2.4776,0.7743,34.2219,NaT,NaN,NaN,NaN,NaN
121313,121314,None,1,712,1,8.990,0.0,8.990,75122,2014-06-30,...,18719.0,30.9700,2.4776,0.7743,34.2219,NaT,NaN,NaN,NaN,NaN
121314,121315,None,1,878,1,21.980,0.0,21.980,75123,2014-06-30,...,10084.0,189.9700,15.1976,4.7493,209.9169,NaT,NaN,NaN,NaN,NaN
121315,121316,None,1,879,1,159.000,0.0,159.000,75123,2014-06-30,...,10084.0,189.9700,15.1976,4.7493,209.9169,NaT,NaN,NaN,NaN,NaN
121316,121317,None,1,712,1,8.990,0.0,8.990,75123,2014-06-30,...,10084.0,189.9700,15.1976,4.7493,209.9169,NaT,NaN,NaN,NaN,NaN

In [98]:
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        ship_method_df = pd.read_sql_query("SELECT ShipMethodID, Name, ShipBase, ShipRate FROM Purchasing.ShipMethod", source_conn)
except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)
ship_method_df

   ShipMethodID                Name  ShipBase  ShipRate
0             1  XRQ - TRUCK GROUND      3.95      0.99
1             2        ZY - EXPRESS      9.95      1.99
2             3   OVERSEAS - DELUXE     29.95      2.99
3             4    OVERNIGHT J-FAST     21.95      1.29
4             5   CARGO TRANSPORT 5      8.99      1.49

In [ ]:
try:
    with pyodbc.connect(source_conn_str) as source_conn:
        salesTerritoryHistory_df = pd.read_sql_query("SELECT BusinessEntityID, TerritoryID, StartDate, EndDate FROM Sales.salesTerritoryHistory", source_conn)

except pyodbc.Error as e:
    print("Error while connecting to the source SQL Server:", e)

salesTerritoryHistory_df